---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedMetal.SurfaceAlbedo
source: html/17ae9a6d-6737-9adc-4d72-1a290f6d9b16.htm
---
# Autodesk.Revit.DB.Visual.AdvancedMetal.SurfaceAlbedo Property

The property labeled "Color" from the "AdvancedMetal" schema.

## Syntax (C#)
```csharp
public static string SurfaceAlbedo { get; }
```

## Remarks
This property is of type "AssetPropertyDoubleArray4d".
 This property allows a connected asset.